// localization_th.dart (สำหรับภาษาไทย)


Map<String, String> localizationTh = {
  'language' : 'th',
  'Terms of Service': 'เงื่อนไขการให้บริการ',
  'I accept the Terms of Service' : 'ฉันยอมรับเงื่อนไขการใช้บริการ',
  'Accept' : 'ยอมรับ',
  'Reject' : 'ปฎิเสธ',
  'Terms of Service for codediva_app' : '''เงื่อนไขการให้บริการของ CodeDiva

ปรับปรุงล่าสุดเมื่อ: 21/9/2023

1. บทนำ

ยินดีต้อนรับสู่ CodeDiva. เงื่อนไขการให้บริการนี้คือข้อกำหนดในการใช้แอปพลิเคชันของเรา และให้ข้อมูลเกี่ยวกับบริการของแอป, ดังที่ระบุไว้ด้านล่าง. โดยการใช้แอปของเรา, คุณยอมรับเงื่อนไขเหล่านี้.

2. การลงทะเบียน

ในการใช้งานฟีเจอร์บางส่วนของแอป, คุณอาจจะต้องลงทะเบียนสำหรับบัญชีผู้ใช้ คุณตกลงที่จะให้ข้อมูลที่แน่นอน, ปัจจุบัน, และครบถ้วนในระหว่างการลงทะเบียน.

3. ความเป็นส่วนตัว

ความเป็นส่วนตัวของคุณเป็นสิ่งสำคัญสำหรับเรา โปรดทบทวนนโยบายความเป็นส่วนตัวของเราเพื่อทราบข้อมูลเกี่ยวกับข้อมูลที่เราเก็บรวบรวมและวิธีที่เราใช้มัน.

4. การใช้แอป

คุณสัญญาว่าจะใช้แอปนี้ตามกฎหมายและระเบียบที่เกี่ยวข้อง.

5. ข้อจำกัด

คุณต้องไม่: (a) แยกส่วน, ย้อนวิศวกรรม, หรือยกเลิกการรวมเพื่อทำให้แอปเป็นรูปแบบที่สามารถอ่านได้; (b) เช่า, ให้เช่าซื้อ, หรือให้สิทธิ์ย่อยของการเข้าถึงแอป; (c) ใช้แอปเพื่อวัตถุประสงค์ที่ผิดกฎหมายหรือต้องห้ามโดยเงื่อนไขเหล่านี้.

6. การยุติ

เราสงวนสิทธิ์ในการยุติหรือระงับบัญชีและการเข้าถึงแอปของคุณตามดุลยพินิจของเรา, โดยไม่ต้องแจ้งให้ทราบล่วงหน้า, สำหรับพฤติกรรมที่เราเชื่อว่าขัดแย้งกับเงื่อนไขเหล่านี้หรือเป็นอันตรายต่อผู้ใช้คนอื่น, เรา, หรือบุคคลที่สาม, หรือสำหรับเหตุผลอื่น ๆ.

7. การเปลี่ยนแปลงเงื่อนไข

เราอาจแก้ไขเงื่อนไขเหล่านี้เป็นครั้งคราว, และรุ่นที่ทันสมัยที่สุดจะถูกโพสต์เสมอที่แอปของเรา หากการแก้ไขมีความสำคัญ, เราจะแจ้งให้ผู้ใช้ทราบ.

8. ติดต่อ

สำหรับคำถามเกี่ยวกับเงื่อนไขเหล่านี้, โปรดติดต่อ [ข้อมูลการติดต่อของคุณ].''',
'username' : 'ชื่อผู้ใช้งาน',
'password' : 'รหัสผ่าน',
'Remember sign-in' : 'บันทึกการเข้าสู่ระบบ',
'Forgot Password?' : 'ลืมรหัสผ่าน?',
'Sign In' : 'เข้าสู่ระบบ',
'Username or password is incorrect' : 'user หรือ password ไม่ถูกต้อง',
"Don't have an account?" : "ไม่มีบัญชีผู้ใช้",
'Sign up to create a user account' : 'เปิดบัญชีเพื่อลงทะเบียนบัญชีผู้ใช้',
'Please enter the registered email or phone number' : 'กรุณากรอกอีเมลหรือเบอร์โทรศัพท์ที่ลงทะเบียน',
'Email / Phone Number' : 'อีเมล / เบอร์โทรศัพท์',
'Send' : 'ส่ง',
'Success' : 'สำเร็จ',
'Your password has been successfully reset' : 'รีเซ็ทรหัสผ่านของคุณสำเร็จแล้ว',
'Done' : 'ตกลง',
'OTP will be sent to your phone number' : 'OTP จะถูกส่งไปที่เบอร์โทรศัพท์',
'Request OTP code' : 'ขอรหัส OTP',
"In case of an incorrect phone number, please contact 02-xxx-xxxx." : "กรณีเบอร์โทรศัพท์ไม่ถูกต้องกรุณาติดต่อเบอร์ 02-xxx-xxxx",
'Verify Identity' : 'ยืนยันตัวตน',
"Please enter the verification code we sent you" : "กรุณากรอกรหัสยืนยันที่เราส่งให้คุณ",
"Didn't receive the code?" : "หากคุณไม่ได้รับรหัส?",
"Resend Code" : "ส่งรหัสใหม่",
"Set PIN CODE" : "ตั้งค่า PIN CODE",
"Confirm PIN CODE" : "ยืนยันรหัส PIN CODE",
"Forgot PIN?" : "ลืมรหัส Pin ?",
"Touch ID" : "Touch ID",
"Set up fingerprint login for faster access" : "ตั้งค่าล็อคอินด้วยลายนิ้วมือเพื่อการเข้าถึงที่รวดเร็วขึ้น",
"Set up Touch ID fingerprint" : "ตั้งค่าลายนิ้วมือ Touch ID",
"Skip" : "ข้าม",
"Scan your fingerprint to verify your identity" : "สแกนลายนิ้วมือเพื่อยืนยันตัวตน",

};
